import sys
from pathlib import Path

import pandas as pd
import pytest

@pytest.fixture
def transactions() -> pd.DataFrame:
    """Набор данныx для теста"""

    return pd.DataFrame(
        {
            "Дата операции": [
                "05.03.2021 12:00:00",  # пятница
                "06.03.2021 13:00:00",  # суббота
                "07.03.2021 14:00:00",  # воскресенье
                "08.03.2021 15:00:00",  # понедельник
                "09.03.2021 16:00:00",  # вторник
                "01.10.2020 10:00:00",  # слишком старая
            ],
            "Номер карты": [
                "*7197",
                "*7197",
                "*5091",
                "*5091",
                "*5091",
                "*7197",
            ],
            "Сумма платежа": [-500.0, -250.0, -1000.0, 3000.0, -20.0, -100.0],
            "Валюта платежа": ["RUB", "RUB", "RUB", "RUB", "USD", "RUB"],
            "Сумма операции": [-500.0, -250.0, -1000.0, 3000.0, -20.0, -100.0],
            "Валюта операции": ["RUB", "RUB", "RUB", "RUB", "USD", "RUB"],
            "Категория": [
                "Супермаркеты",
                "Супермаркеты",
                "Переводы",
                "Пополнения",
                "Фастфуд",
                "Супермаркеты",
            ],
            "Описание": [
                "Колхоз",
                "Магнит",
                "Валерий А.",
                "Зарплата",
                "Burger",
                "Старый магазин",
            ],
        }
    )